{
  "CONNECT": {
    "title": "Connect (or Get Involved)",
    "description": "Be part of a growing community of Christ's followers where you feel at home, discover life's purpose, serve, and journey together. Join discipleship groups that provide support, encourage spiritual growth, and help you live holistically healthy with fellow believers who serve one another in Christ's Name and reach out to others."
  },
  "DISCIPLESHIP_MINISTRIES": {
    "title": "Discipleship Ministries",
    "description": "CFMC offers ministries designed to disciple believers of all ages, equipping them to grow in faith and serve in the name of Jesus Christ."
  },
  "DISCIPLESHIP_MINISTRIES_QUOTE": {
    "title": "Great Commission",
    "isQuote": true,
    "description": "Then Jesus came to them and said, \"All authority in heaven and on earth has been given to me. Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I am with you always, to the very end of the age.\" – Matthew 28:18-20 (NIV)"
  },
  "CHILDREN_MINISTRY": {
    "title": "Children Ministry",
    "description": "Nurturing children in the love of Christ through Bible-based teachings, fun activities, and fellowship. Contact: Deaconess Wendy Valdez (368 995 8928)."
  },
  "CHILDREN_MINISTRY_QUOTE": {
    "title": "Children Ministry Verse",
    "isQuote": true,
    "description": "Jesus said, \"Let the little children come to me, and do not hinder them, for the kingdom of heaven belongs to such as these.\" – Matthew 19:14 (NIV)"
  },
  "YOUTH_YOUNG_ADULTS": {
    "title": "Youth & Young Adults Fellowship",
    "description": "Empowering young people to live out their faith boldly by building friendships, serving the church, and setting an example of godly living. Contact: Pastor Jonavern (587 888 4216)."
  },
  "YOUTH_YOUNG_ADULTS_QUOTE": {
    "title": "Youth & Young Adults Verse",
    "isQuote": true,
    "description": "Don't let anyone look down on you because you are young, but set an example for the believers in speech, in conduct, in love, in faith and in purity. – 1 Timothy 4:12 (NIV)"
  },
  "MENS_FELLOWSHIP": {
    "title": "Men's Fellowship",
    "description": "Encouraging men to grow in faith, pursue righteousness, and support one another in Christian living. Contact: Bro. June Tugade (587 223 5710)."
  },
  "MENS_FELLOWSHIP_QUOTE": {
    "title": "Men's Fellowship Verse",
    "isQuote": true,
    "description": "But you, man of God, flee from all this, and pursue righteousness, godliness, faith, love, endurance and gentleness. Fight the good fight of the faith. Take hold of the eternal life to which you were called when you made your good confession in the presence of many witnesses. – 1 Timothy 6:11-12 (NIV)"
  },
  "WOMENS_FELLOWSHIP": {
    "title": "Women's Fellowship",
    "description": "A fellowship that inspires women to live faithfully, serve the Lord, and grow in spiritual maturity together. Contact: Sis. Luz Tugade (403 771 1826)."
  },
  "WOMENS_FELLOWSHIP_QUOTE": {
    "title": "Women's Fellowship Verse",
    "isQuote": true,
    "description": "Charm is deceptive, and beauty does not last; but a woman who fears the Lord will be greatly praised. – Proverbs 31:30 (NLT)"
  },
  "PRAISE_WORSHIP_TEAM": {
    "title": "Praise & Worship Team",
    "description": "Leading the congregation into God's presence through music, worship, and thanksgiving. Contacts: Deaconess Nelia Soriano (403 880 9753), Sis. Zarah May Reyes (403 771 8852)."
  },
  "PRAISE_WORSHIP_TEAM_QUOTE": {
    "title": "Praise & Worship Verse",
    "isQuote": true,
    "description": "Come, let us sing for joy to the LORD; let us shout aloud to the Rock of our salvation. Let us come before him with thanksgiving and extol him with music and song. – Psalm 95:1-2 (NIV)"
  },
  "MULTIMEDIA_TEAM": {
    "title": "Multimedia Team",
    "description": "Supporting the church's mission by using technology and media to share God's Word effectively. Contact: Bro. Christian Valdez (204 898 7498)."
  },
  "MULTIMEDIA_TEAM_QUOTE": {
    "title": "Multimedia Verse",
    "isQuote": true,
    "description": "How, then, can they call on the one they have not believed in? And how can they believe in the one of whom they have not heard? And how can they hear without someone preaching to them? And how can anyone preach unless they are sent? As it is written: \"How beautiful are the feet of those who bring good news!\" – Romans 10:14-15 (NIV)"
  },
  "OUTREACH_MINISTRY": {
    "title": "Outreach Ministry",
    "description": "Serving the community through compassion-driven initiatives like Free Bread Distribution (in partnership with COBS Bread Bakery – Chestermere). Contact: Bro. Vincent Vinluan (403 629 7784)."
  },
  "OUTREACH_MINISTRY_QUOTE": {
    "title": "Outreach Ministry Verse",
    "isQuote": true,
    "description": "The King will reply, 'Truly I tell you, whatever you did for one of the least of these brothers and sisters of mine, you did for me.' – Matthew 25:40 (NIV)"
  }
}
